app/controllers/restaurants_controller.rb

  def create
    @restaurant = Restaurant.create(restaurant_params)
---
INSERT INTO "restaurants" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "KFC"], ["description", ""], ["created_at", "2016-05-25 11:05:37.884181"], ["updated_at", "2016-05-25 11:05:37.884181"]]

  def update
    @restaurant = Restaurant.find(params[:id])
    @restaurant.update(restaurant_params)
---
SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "Kentucky Fried Chicken"], ["updated_at", "2016-05-25 11:05:37.992969"], ["id", 4]]